src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пм_УстановленныеПакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаяВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пм_ИсточникиПакетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру записи регистра.
//
// Возвращаемое значение:
//  Структура - Поля записи:
// * Источник - СправочникСсылка.пм_ИсточникиПакетов
// * Пакет - Строка
// * Версия - Строка
// * ИмяФайла - Строка
// * ДатаУстановки - Дата
// * ТекстОшибки - Строка
// * ДоступнаяВерсия - Строка
// * ДатаПроверки - Дата
//
Функция СтруктураЗаписи() Экспорт

	Возврат Новый Структура(
		"Источник, Пакет, Версия, ИмяФайла, ДатаУстановки, ТекстОшибки,
		|ДоступнаяВерсия, ДатаПроверки");

КонецФункции

// Записывает информацию об установленном пакете.
//
// Параметры:
//  СтруктураЗаписи - Структура - См. СтруктураЗаписи
//
// Возвращаемое значение:
//  Булево - Истина, если информация успешно обновлена.
//
Функция ОбновитьСведения(СтруктураЗаписи) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Пакет.Установить(СтруктураЗаписи.Пакет);
	Набор.Отбор.Источник.Установить(СтруктураЗаписи.Источник);
	Набор.Прочитать();

	Если Набор.Количество() > 0 Тогда
		Запись = Набор[0];
	Иначе
		Запись = Набор.Добавить();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтруктураЗаписи.ДатаУстановки) Тогда
		СтруктураЗаписи.ДатаУстановки = ТекущаяДатаСеанса();
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(Запись, СтруктураЗаписи);

	Попытка
		Набор.Записать();
	Исключение
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не удалось обновить сведения об установленном пакете %1: %2'"),
			СтруктураЗаписи.Пакет,
			ОписаниеОшибки());
	КонецПопытки;

	Возврат Истина;

КонецФункции

// Возвращает установленные версии пакетов.
//
// Параметры:
//  СписокПакетов - Массив, Строка - Отбор по именам пакетов, необязательный.
//  Источник - СправочникСсылка.пм_ИсточникиПакетов - Отбор по источнику, необязательный.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Колонки Источник, Пакет, Версия, ИмяФайла, ДатаУстановки, ТекстОшибки.
//
Функция ВерсииПакетов(СписокПакетов = Неопределено, Источник = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УстановленныеПакеты.Источник КАК Источник,
	|	УстановленныеПакеты.Пакет КАК Пакет,
	|	УстановленныеПакеты.Версия КАК Версия,
	|	УстановленныеПакеты.ИмяФайла КАК ИмяФайла,
	|	УстановленныеПакеты.ДатаУстановки КАК ДатаУстановки,
	|	УстановленныеПакеты.ТекстОшибки КАК ТекстОшибки,
	|	УстановленныеПакеты.ДоступнаяВерсия КАК ДоступнаяВерсия,
	|	УстановленныеПакеты.ДатаПроверки КАК ДатаПроверки
	|ИЗ
	|	РегистрСведений.пм_УстановленныеПакеты КАК УстановленныеПакеты
	|ГДЕ
	|	ИСТИНА";

	Если ЗначениеЗаполнено(СписокПакетов) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И УстановленныеПакеты.Пакет В (&СписокПакетов)";
		Запрос.УстановитьПараметр("СписокПакетов", СписокПакетов);
	КонецЕсли;

	Если ЗначениеЗаполнено(Источник) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И УстановленныеПакеты.Источник = &Источник";
		Запрос.УстановитьПараметр("Источник", Источник);
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
